app/controllers/reviews_controller.rb

def create
#	@movie = Movie.find(params[:movie_id])
  @review = @movie.reviews.new(review_params)
  if @review.save
---
INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "lina"], ["stars", 4], ["comment", "I found it. he have iron heart."], ["movie_id", 1], ["created_at", 2016-08-13 04:53:41 UTC], ["updated_at", 2016-08-13 04:53:41 UTC]]

	def set_event
		@movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]